import React, { useState } from "react";

export default function App() {
  const questions = [
   {
    "question": "1. Молдо Кылычтын чыгармаларын эң алгач изилдөөгө алган изилдөөчү?",
    "options": ["Т.Саманчин", "К.Асаналиев", "К.Артыкбаев", "К.Даутов"],
    "answer": "Т.Саманчин"
  },
  {
    "question": "2. Молдо Кылычтын кайсы чыгармасынан үзүндү берилген?\nОрус деген калкыңдын,\nКыйын экен буйругу\nМалай кылды кыргызды.",
    "options": ["“Зар заман”", "“Казалдар”", "“Буудайык”", "“Чүй баяны”"],
    "answer": "“Зар заман”"
  },
  {
    "question": "3. Молдо Нияз кыргыздардын кайсы улуу инсаны жөнүндө санатын жазат?",
    "options": ["Алымбек датка", "Манас", "Курманжан датка", "Барсбек каган"],
    "answer": "Алымбек датка"
  },
  {
    "question": "4. Молдо Нияз кайсы жылы туулган?",
    "options": ["1824-жылы", "1823-жылы", "842-жылы", "1834-жылы"],
    "answer": "1823-жылы"
  },
  {
    "question": "5. Төмөнкү ыр саптары кимге таандык?\nСанаа тартып Курманжан,\nСаңа кыйын иш болду.\nАлымбектин даврида\nКийгениң кымкап, киш болду.",
    "options": ["Тоголок.Молдо", "Арстанбек", "Молдо Нияз", "Калыгул"],
    "answer": "Молдо Нияз"
  },
  {
    "question": "6. Төмөнкү ыр саптары кимге таандык?\nӨңү сары, көзү көк,\nОрус келет дешти эде.\nТемир жолдор салынып,\nПоюз келет дешти эде.\nАрка жагы ачылган\nКийим чыгат дешти эде.\nАтасыдан баласы\nКыйын чыгат дешти эде.",
    "options": ["Молдо Нияз", "Арстанбек Буйлаш уулу", "Калыгул", "Молдо Кылыч"],
    "answer": "Арстанбек Буйлаш уулу"
  },
  {
    "question": "7. Арстанбек Буйлаш уулу качан, каерде туулган?",
    "options": [
      "1824-жылы, Ысык-Көл өрөөнүндө",
      "1827-жылы, Нарын өрөөнүндө",
      "1826-жылы, Атбашы өрөөнүндө",
      "1830-жылы, Чүй өрөөнүндө"
    ],
    "answer": "1824-жылы, Ысык-Көл өрөөнүндө"
  },
  {
    "question": "8. Арстанбектин чыгырмачылыгын алгачкы изилдөөчү ким?",
    "options": ["К.Мифтаков", "К.Абдырахманов", "Осмокул", "Т.Саманчин"],
    "answer": "К.Мифтаков"
  },
  {
    "question": "9. Кайсы сапты улап жазууга болот?\nЖакшы аял белгиси\nБулгаары кылат терини...",
    "options": [
      "Көркөм кылат жерини",
      "Мырза кылат эрини",
      "жыргатып өтөт эрини",
      "алгыр куш кылат эрини"
    ],
    "answer": "Мырза кылат эрини"
  },
  {
    "question": "10. Калыгул Бай уулу качан жана кайсы жерде туулган?",
    "options": [
      "1727-жылы, Талас өрөөнүндө",
      "1826-жылы, Атбашы өрөөнүндө",
      "1785-жылы, Ысык-Көл өрөөнүндө",
      "1830-жылы, Чүй өрөөнүндө"
    ],
    "answer": "1785-жылы, Ысык-Көл өрөөнүндө"
  },
  {
    "question": "11. Калыгул Бай уулунун чыгармаларын алгач кагаз бетине түшүргөн изилдөөчү?",
    "options": ["Б.Юнусалиев", "К.Мифтаков", "Т.Саманчин", "Ч.Валиханов"],
    "answer": "К.Мифтаков"
  },
  {
    "question": "12. Бул саптар кайсы акынга таандык?\nБул дүйнөдөн аккан суудай,\nАйкаштагы чуудай,\nТөгүлгөн кумдай бардыгы өтөт.\nЖараткандан үчөө гана өлбөйт,...\nКалдайган кара жер өлбөйт,\nАскасы бийик зоо өлбөйт,\nАгыны катуу суу өлбөйт.",
    "options": ["Молдо Нияз", "Тоголок Молдо", "Алдаш Молдо", "Калыгул"],
    "answer": "Калыгул"
  },
  {
    "question": "13. Элдик арман ырларында негизинен эмнелер чагылдырылган?",
    "options": [
      "элдин баатырдык иштери",
      "эмгектин жетишкендиктери",
      "жаратылыштын кооздугу",
      "тигил же бул себепке байланыштуу адамдын кайгы – муңу, арманы"
    ],
    "answer": "тигил же бул себепке байланыштуу адамдын кайгы – муңу, арманы"
  },
  {
    "question": "14. Т. Молдонун чыгармаларын биринчилерден болуп изилдеген инсанды белгиле?",
    "options": ["Ж. Таштемиров", "Б. Юнусалиев", "Т. Саманчин", "А. Эркебаев"],
    "answer": "Ж. Таштемиров"
  },
  {
    "question": "15. ысык –Көл кээде тынч да кээде толкун,\nТолкуса толкунуна тең ортокмун. Бул ыр саптары кайсы акынга таандык?",
    "options": ["A.Осмонов", "А.Токомбаев", "К.Тыныстанов", "Б.Сарногоев"],
    "answer": "A.Осмонов"
  },
  {
    "question": "16. Элдик «Оп майда» ырында кимдердин тилеги, ой – санаасы берилет?",
    "options": ["дыйкандардын", "койчулардын", "кол өнөрчүлөрдүн", "жылкычылардын"],
    "answer": "дыйкандардын"
  },
  {
    "question": "17. Көркөм чыгармада табият көркүнүн сүрөттөлүшү эмне деп аталат.",
    "options": ["портрет", "диалог", "пейзаждык сүрөттөө", "сюжет"],
    "answer": "пейзаждык сүрөттөө"
  },
  {
    "question": "18. Коомдогу ар кандай карама-каршылыктардын көркөм чыгармада берилиши жана андагы ар кандай, ар түрдүү адам каармандардын кагылыш күрөшү кандайча аталат.",
    "options": ["сюжет", "конфликт", "композиция", "эпилог"],
    "answer": "конфликт"
  },
  {
    "question": "19. Көркөм чыгармада көрүнүштөрдү каймана сүрөттөөнү, образдарды өтмө мааниде берүүнү эмне дейбиз.",
    "options": ["ирония", "достук азил", "аллегория", "гипербола"],
    "answer": "аллегория"
  },
  {
    "question": "20. Көркөм чыгармада каармандардын жекече окурманга же көрүүчүлөргө карата айткан сөзү эмне деп аталат.",
    "options": ["монолог", "диолог", "монодрама", "автордук баяндама"],
    "answer": "монолог"
  },
  {
    "question": "21. Көркөм чыгарманын эң акырында каармандардын андан аркы турмушу жөнүндө берилген кыскача баян эмне деп аталат.",
    "options": ["сюжет", "композиция", "пролог", "эпилог"],
    "answer": "эпилог"
  },
  {
    "question": "22. Бир нерсени, көрүнүштү башка бир нерсе же көрүнүш менен атоого негизделген көркөм сөз каражаты эмне деп аталат.",
    "options": ["метонимия", "метафора", "синекдоха", "салыштыруу"],
    "answer": "метафора"
  },
  {
    "question": "23. Кыргыз адабиятындагы ыр менен жазылган биринчи романды белгиле?",
    "options": ["«Кең суу»", "«Кандуу жылдар»", "«Адамдар»", "“Курманжан”"],
    "answer": "«Кандуу жылдар»"
  },
  {
    "question": "24. А.Токомбаевдин “Октябрдын келген кези” деген ыры качан кайсы газетага чыккан?",
    "options": [
      "1924-жылы “Эркин тоо” газетасы",
      "1924-жылы “Ала Тоо” журналы",
      "1925-жылы “Октябрь таңы” газетасы",
      "1924-жылы “Кызыл Кыргызстан” газетасы"
    ],
    "answer": "1924-жылы “Эркин тоо” газетасы"
  },
  {
    "question": "25. “Кандуу жылдар” романынын башкы каарманы ким?",
    "options": ["Мурат", "Антон", "Алымкул", "Железнов"],
    "answer": "Мурат"
  },
  {
    "question": "26. “Кандуу жылдар” романы кайсы мезгилдеги окуяны чагылдырат?",
    "options": [
      "экинчи дүйнөлүк согуш учурундагы окуяны",
      "биринчи дүйнөлүк согуш учурундагы окуяны",
      "Кокон хандыгы мезгилиндеги окуяны",
      "1916-жылдагы окуяны чагылдырат"
    ],
    "answer": "1916-жылдагы окуяны чагылдырат"
  },
  {
    "question": "27. “Кандуу жылдар” романында Манастын Бакайындай акылман, көсөм, жол баштоочу катары сүрөттөлгөн образ?",
    "options": ["Мурат", "Алымкул", "Антон", "Абыл"],
    "answer": "Абыл"
  },
  {
    "question": "28. Бул ыр саптары кайсы акынга таандык?\nМен уялбайм дайым бүркөө түрүмдөн\nЖаш болсом да картка окшогон сүрүмдөн,\nКойдум, курбум, мунуң жаман - дее албайм,\nӨзгөрмөй жок жаралган түс, гүлүмдөн.",
    "options": ["А.Токомбаев", "М.Алыбаев", "К.Тыныстанов", "А.Осмонов"],
    "answer": "К.Тыныстанов"
  },
  {
    "question": "29. А.Осмоновдун өмүр темасындагы лирикалары.",
    "options": [
      "“Өмүр”, “Курбум”, “Ала-Тоонун аскасынан ашалы”",
      "“Өмүр”, “Тирүүлүк”, “Отуз жаш”, “Биздин күндөр”",
      "“Тил алса”, “Кыялды талдаганда”",
      "“Каалаганым”, “Баатырдын өлүмү”"
    ],
    "answer": "“Өмүр”, “Тирүүлүк”, “Отуз жаш”, “Биздин күндөр”"
  },
  {
    "question": "30. “Ыр сабындагы өмүр” аттуу китеп ким жөнүндө, автору ким.",
    "options": [
      "Алыкул жөнүндө. К.Жусупов",
      "Аалы жөнүндө. А.Стамов",
      "Токтогул жөнүндө. Ж.Бөкөнбаев",
      "Асанбек Жөнүндө. К.Жусупов"
    ],
    "answer": "Алыкул жөнүндө. К.Жусупов"
  },
  {
    "question": "31. “Ырас өмүр кандай кыска кандай аз...\nТагдыр ошол өлчөмүнөн көп кылбас” Бул саптар менен А.Осмоновдун кайсы ыры башталат.",
    "options": ["“Өмүр”", "“Отуз жаш”", "“Адамзатка”", "“Тирүүлүк”"],
    "answer": "“Отуз жаш”"
  },
  {
    "question": "32. А.Осмоновдун адабий тушоосун кескен чыгармасы кандай аталат, ал кайсы газетага, качан жарыяланган.",
    "options": [
      "“Жагы талаа”, “Эркин- Тоо”, 1928-ж.",
      "“Зарыгам”, “Эркин-Тоо”, 1924-ж.",
      "“Кызыл -жүк”, “Сабаттуу бол”, 1930-ж.",
      "“Шаңдан жүрөк”, “Көмек”, 1919-ж."
    ],
    "answer": "“Кызыл -жүк”, “Сабаттуу бол”, 1930-ж."
  },
  {
    "question": "33. Ч.Айтматов “Жамийла” повестинде Данияр менен окурманды кайсы эпизоддо тааныштырат.",
    "options": [
      "Данияр менен Жамийланын сүйлөшүп турган жеринен",
      "Данияр кырманда арабанын дөңгөлөктөрүн майлап, барамаларын бекитип жаткан учурда",
      "Данияр трап менен карала капты көтөрүп бараткан учурунда",
      "Данияр августтун жылдыздуу түнүндө ырдап келе жаткан учурда"
    ],
    "answer": "Данияр кырманда арабанын дөңгөлөктөрүн майлап, барамаларын бекитип жаткан учурда"
  },
  {
    "question": "34. Ч.Айтматовдун эң алгачкы чыгармасы кайсы жана качан жарык көргөн?",
    "options": [
      "1968 “Жамийла”",
      "1952 “Газетчик Дзюё”",
      "1980 “Кылым карыткан бир күн”",
      "1957 “Асма көпүрө”"
    ],
    "answer": "1952 “Газетчик Дзюё”"
  },
  {
    "question": "35. Ч.Айтматовго “Кыргыз ССРинин эл жазуучусу” деген наам кайсы жылы ыйгарылган?",
    "options": ["1965-жылы", "1970-жылы", "1966-жылы", "1968-жылы"],
    "answer": "1968-жылы"
  },
  {
    "question": "36. Ч.Айтматовдун “Кылым карытар бир күн” романындагы Зарипа ким.",
    "options": [
      "Кум-Белдеги интернаттын музыка мугалими",
      "Казангаптын алыска турмушка чыккан кызы",
      "Абуталиптин аялы, кийин Борондуу Эдигей сүйүп калган келин",
      "Токой-Төш космодромунда иштеген оператор келин"
    ],
    "answer": "Абуталиптин аялы, кийин Борондуу Эдигей сүйүп калган келин"
  },
  {
    "question": "37. Ч.Айтматовдун “Кылым карытар бир күн” романында Маңкурт деген ким.",
    "options": [
      "байыркы заманда жуңжаңдарга колго түшүп акыл-эстен ажыратылган, ата-тегин унуткан кул",
      "байыркы заманда казактар менен касташкан жуңжаң деген калктын аскер башчысы",
      "байыркы заманда казактар менен касташкан жуңжаң деген калктын катардагы жоокери",
      "байыркы заманда жуңжаңдардын казактарга колго түшкөн жоокери"
    ],
    "answer": "байыркы заманда жуңжаңдарга колго түшүп акыл-эстен ажыратылган, ата-тегин унуткан кул"
  },
  {
    "question": "38. Т.Сыдыкбековдун «Too арасында» романында кайсы каарман кыз ала качып, ошондон улам адамдар эки тарап болуп жаатташып калышат?",
    "options": ["Саадат", "Соке", "Сапарбай", "Калпакбайуп"],
    "answer": "Сапарбай"
  },
  {
    "question": "39. «Кең-Суу» ( «Too арасында») романында негизинен кайсы мезгилдеги турмуш сүрөттөлүп берилет?",
    "options": [
      "байыркы доордогу турмуш",
      "колхоздоштуруу мезгилиндеги турмуш чындыгы",
      "улуу Ата-Мекендик согуш мезгилиндеги турмуш",
      "октябрь төңкөрүшүнүн учурундагы турмуш"
    ],
    "answer": "колхоздоштуруу мезгилиндеги турмуш чындыгы"
  },
  {
    "question": "40. Т. Сыдыкбековдун «Too арасында» романында жаңыча там салам деп эшик терезеси жок там салып алган, кеттим деп адатынча атын тынбай чапкылап, бирок бир дөңдү айланып жүрө берген каарман ким?",
    "options": ["Самтыр", "Ыманбай", "Саадат", "Кийизбай"],
    "answer": "Кийизбай"
  },
  {
    "question": "41. «Сынган кылыч» романында Нүзүп кандай адам катары көрсөтүлөт?",
    "options": [
      "эр көкүрөк, баатыр адам катары",
      "ала көөдөк жеңил адам катары",
      "Кокон хандыгынын саясатын терең түшүнгөн, өз максатына ыраттуулук менен жеткен, акылгөй адам катары",
      "жеткен арамза, ордонун ишин ичкериден ириткен адам катары"
    ],
    "answer": "Кокон хандыгынын саясатын терең түшүнгөн, өз максатына ыраттуулук менен жеткен, акылгөй адам катары"
  },
  {
    "question": "42. «Сынган кылыч» романында эмне үчүн Нүзүп аталык Алтынбешиктер династиясынын акыркы өкүлү Шералини хан көтөргөндө тактысынын маңдайына Шералинин жаман чокоюн илип койду?",
    "options": [
      "Шералинин өткөн карыптык күнүн эске салып турсун, көптүрбөсүн, эсиртпесин деп",
      "чокойду иле турган башка жер жоктугунан улам",
      "Шералинин өзүнүн каалосу ушундай болду",
      "Алтынбешик династиясынын эзетен келе жаткан салт ушундай болгондуктан улам"
    ],
    "answer": "Шералинин өткөн карыптык күнүн эске салып турсун, көптүрбөсүн, эсиртпесин деп"
  },
  {
    "question": "43. Тарыхый роман кандай сапат-белгилерге ээ болуу керек?",
    "options": [
      "ар кандай тарыхый романда өткөн турмуш менен бүгүнкү күн эриш-аркак сүрөттөлүш керек",
      "бүгүнкү күндүн адамдарын деле архаикалык сөздөр менен сүйлөтүп койсо тарыхый роман болот",
      "тарыхый роман болуу үчүн тарыхый окуялардын, тарыхый инсандардын, жазуучу менен сүрөттөлүж жаткан окуялардын ортосунда мезгилдик дистанциянын, тарыхый атрибуттардын болуусу зарыл",
      "бир, эки тарыхый инсандын атын атап коюп бүгүнкү күндү сүрөттөсө деле тарыхый роман боло берет"
    ],
    "answer": "тарыхый роман болуу үчүн тарыхый окуялардын, тарыхый инсандардын, жазуучу менен сүрөттөлүж жаткан окуялардын ортосунда мезгилдик дистанциянын, тарыхый атрибуттардын болуусу зарыл"
  },
  {
    "question": "44. «Сынган кылыч» романы кайсы мезгилдеги окуяларды баяндайт?",
    "options": [
      "Орхон-Энесай доорундагы учурду",
      "Чынгызхандын жортуулу учурундагы",
      "Кокон хандыгынын учурундагы",
      "Октябрь төңкөрүшүнүн учурундагы"
    ],
    "answer": "Кокон хандыгынын учурундагы"
  },
  {
    "question": "45. Т. Касымбековдун «Сынган кылыч» романы кайсы окуяны сүрөттөөдөн башталат?",
    "options": [
      "Шералынын Кокон хандыгынын тактысына келип отурган окуяны сүрөттөө менен",
      "Исхактын көтөрүлүшүн сүрөттөө менен",
      "Нүзүптүн курмандыкка чалынышын сүрөттөө менен",
      "1865-жылдагы Ташкен шаарына жакын жердеги генерал Черняевдин аскерлери менен Алымкул аталыктын атчандарынын ортосундагы зор кагылышты сүрөттөө менен."
    ],
    "answer": "1865-жылдагы Ташкен шаарына жакын жердеги генерал Черняевдин аскерлери менен Алымкул аталыктын атчандарынын ортосундагы зор кагылышты сүрөттөө менен."
  },
  {
    "question": "46. «Сынган кылыч» романында нукура эпикалык баатырлардай мүнөздөлүп сүрөттөлгөн каарман ким жана аны ким эмне кылып өлтүрдү?",
    "options": [
      "Исках, аны Нүзүп сууга түртүп чөктүрүп өлтүрдү",
      "Бекназар, аны Абил бий уу берип өлтүрдү",
      "Мусулманкул, аны Кудаяр зынданга салып өлтүрдү",
      "Кулкиши, аны Кудаярхан дарга асып өлтүрдү"
    ],
    "answer": "Бекназар, аны Абил бий уу берип өлтүрдү"
  },
  {
    "question": "47. «Сынган кылыч» романында Абил бий кандай кейипкер.",
    "options": [
      "ордонун оош-кыйыш саясатын ичкериден билип турган, ашкан куу, өз кызыкчылыгын барыдан жогору койгон митайым адам",
      "жеткен ак көңүл,эч кимдин көңүлүн орутпаган киши",
      "колунан берекеси төгүлгөн жоомарт, берешен адам",
      "эч нерсени элес албаган, маңыроо чалыш, аңкоо адам"
    ],
    "answer": "ордонун оош-кыйыш саясатын ичкериден билип турган, ашкан куу, өз кызыкчылыгын барыдан жогору койгон митайым адам"
  },
  {
    "question": "48. “Сынган кылыч” романында Мусулманкулдун эмчектеш тууганы катары ким эсептелет?",
    "options": ["Бекназар", "Нүзүп", "Алманбет", "Абдылдабек"],
    "answer": "Бекназар"
  },
  {
    "question": "49. Төмөнкү эпизоддон кимдердин ортосундагы конфликтти байкоого болот?\nАтасы:\n- Кечтим сенин балагыгыңдан! Ак кылдым! Ак кылдым! Жогол! Бетиң карайсың, ата безери, бетиңди карабаймын, жогол, көзүмө көрүнбөй!\nУулу:\n- Сен мени балалыгымдан кечсең, мен сени аталыгыңдан кечтим! Кечтим! Ата болуп качан чекеми жылыттың?",
    "options": [
      "Шералы менен Кудаярдын",
      "Мусулманкул менен Абдрахмандын",
      "Эсенбай менен Нүзүптүн",
      "Алымбек менен Камчыбектин"
    ],
    "answer": "Мусулманкул менен Абдрахмандын"
  },
  {
    "question": "50. Т.Касымбековдун 1956-жылы басмадан чыккан биринчи ангемелер жыйнагы кандай деп аталат?",
    "options": ["“Кыскача өмүр баян”", "“Кичинекей жылкычы”", "“Адам болгум келет”", "“Лайли менен Мажнун”"],
    "answer": "“Кичинекей жылкычы”"
  },
  ];

  const [currentQuestion, setCurrentQuestion] = useState(0);
  const [score, setScore] = useState(0);
  const [finished, setFinished] = useState(false);

  const [results, setResults] = useState([]);

  const checkAnswer = (option) => {
    const correct = questions[currentQuestion].answer;

    setResults([
      ...results,
      {
        question: questions[currentQuestion].question,
        selected: option,
        correctAnswer: correct,
        isCorrect: option === correct,
      },
    ]);

    if (option === correct) {
      setScore(score + 1);
    }

    const next = currentQuestion + 1;

    if (next < questions.length) {
      setCurrentQuestion(next);
    } else {
      setFinished(true);
    }
  };

  return (
    <div style={{ padding: "20px", fontFamily: "sans-serif" }}>
      <h1>Кыргыз тили жана адабияты</h1>

      {finished ? (
        <div>
          <h2>Тест аяктады</h2>

          <h3>
            Жыйынтык: {score} / {questions.length}
          </h3>

          {results.map((item, index) => (
            <div
              key={index}
              style={{
                marginBottom: "20px",
                padding: "10px",
                border: "1px solid #ccc",
                borderRadius: "10px",
                backgroundColor: item.isCorrect
                  ? "#d4edda"
                  : "#f8d7da",
              }}
            >
              <h4>
                {index + 1}. {item.question}
              </h4>

              <p>
                <strong>Сиздин жооп:</strong>{" "}
                <span
                  style={{
                    color: item.isCorrect ? "green" : "red",
                  }}
                >
                  {item.selected}
                </span>
              </p>

              {!item.isCorrect && (
                <p>
                  <strong>Туура жооп:</strong>{" "}
                  <span style={{ color: "green" }}>
                    {item.correctAnswer}
                  </span>
                </p>
              )}
            </div>
          ))}
        </div>
      ) : (
        <div>
          <h2>
            {currentQuestion + 1}.{" "}
            {questions[currentQuestion].question}
          </h2>

          {questions[currentQuestion].options.map((option, index) => (
            <div key={index} style={{ marginBottom: "10px" }}>
              <button
                onClick={() => checkAnswer(option)}
                style={{
                  padding: "10px 20px",
                  cursor: "pointer",
                  borderRadius: "10px",
                  border: "none",
                }}
              >
                {option}
              </button>
            </div>
          ))}

          <p>
            Суроо {currentQuestion + 1} / {questions.length}
          </p>
        </div>
      )}
    </div>
  );
}